# Для набора прямоугольников, стороны которых параллельны OX и OY, заданных координатами 2-х диагональных вершин,
# найти прямоугольник, внутри которого расположено максимальное кол-во других прямоугольников
# (граница вложенного прямоугольника может проходить по границе внешнего прямоугольника). В случае существования нескольких
# подходящих прямоугольников – выбрать максимальной площади (если и таких будет несколько – то произвольный).
# Задача 6, только применительно к набору окружностей (кругов).



